
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МнеИзвестенВозрастЧеловекаРавный(Парам01)","МнеИзвестенВозрастЧеловекаРавный","Допустим мне известен возраст человека равный 25","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастВМесяцахБудетРавен(Парам01)","ВозрастВМесяцахБудетРавен","Тогда возраст в месяцах будет равен 300","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим мне известен возраст человека равный 25
//@МнеИзвестенВозрастЧеловекаРавный(Парам01)
Процедура МнеИзвестенВозрастЧеловекаРавный(Возраст) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	Контекст.Вставить("Возраст", Возраст);
КонецПроцедуры

&НаКлиенте
//Тогда возраст в месяцах будет равен 300
//@ВозрастВМесяцахБудетРавен(Парам01)
Процедура ВозрастВМесяцахБудетРавен(ОжидаемыйРезультат) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	Результат = ОбщийМодуль1.ПолучитьВозрастЧеловекаВМесяцах(Контекст.Возраст);
	Если Результат <> ОжидаемыйРезультат Тогда
		ВызватьИсключение "Результат рассчитан неверно"; 
	КонецЕсли;
КонецПроцедуры
